export default {
  isServiceTel: /^\d+(-\d+)*$/,
  loanRate: /^\d+(.\d+)*$/, // 利率
  isInteger: /^(?!0)\d+$/, // 正整数
  isNid: /^[a-z0-9_]+$/, // 消息模板NID
  loginUser: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{0,10}$/, // 10位以下数字&字母组合
  loginPwd: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,10}$/, // 6-10位数字&字母组合
  user: /^[\u4e00-\u9fa5a-zA-Z0-9]{0,10}$/, // 10位以下中文、数字、字母
  isPositive: /^(?!0)\d+(.\d{1,2})?$/, // 正数
  commissionRatio: /^([1-9]\d*|0)(.\d{1,2})?$/, // 返佣比例(百分比)：大于等于0的整数或小数
  phone: /^1\d{10}$/, // 手机号
  cardNo: /^\d{17}[0-9|X]$/, // 身份证号
};
